Revit 2024 API
AnalysisDisplayVectorSettings Constructor (AnalysisDisplayVectorSettings)
 Constructs a new copy of the input AnalysisDisplayVectorSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public AnalysisDisplayVectorSettings(
	AnalysisDisplayVectorSettings other
)
Visual Basic
Public Sub New ( _
	other As AnalysisDisplayVectorSettings _
)
Visual C++
public:
AnalysisDisplayVectorSettings(
	AnalysisDisplayVectorSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalysisDisplayVectorSettings Class
AnalysisDisplayVectorSettings Overload
Autodesk.Revit.DB.Analysis Namespace